# Import

In [83]:
import pandas as pd
import numpy as np

# Read Dataset

In [84]:
df = pd.read_csv("brain_stroke.csv")

In [85]:
df.head()

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81.0,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1

# Jumlah record dan column

In [86]:
df.shape

(4981, 11)

# Nama dan Jumlah Atribut

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4981 entries, 0 to 4980
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   gender             4981 non-null   object
 1   age                4981 non-null   float64
 2   hypertension       4981 non-null   int64
 3   heart_disease      4981 non-null   int64
 4   ever_married       4981 non-null   object
 5   work_type          4981 non-null   object
 6   Residence_type     4981 non-null   object
 7   avg_glucose_level  4981 non-null   float64
 8   bmi                4981 non-null   float64
 9   smoking_status     4981 non-null   object
 10  stroke             4981 non-null   int64
dtypes: float64(3), int64(3), object(5)
memory usage: 428.2+ KB

# Mean,Max,Min,Standar deviasi,Q1,Q2,Q3

In [88]:
df.describe()

,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
count,4981.000000,4981.000000,4981.000000,4981.000000,4981.000000,4981.000000
mean,43.419859,0.096165,0.055210,105.943562,28.498173,0.049789
std,22.662755,0.294848,0.228412,45.075373,6.790464,0.217531
min,0.080000,0.000000,0.000000,55.120000,14.000000,0.000000
25%,25.000000,0.000000,0.000000,77.230000,23.700000,0.000000
50%,45.000000,0.000000,0.000000,91.850000,28.100000,0.000000
75%,61.000000,0.000000,0.000000,113.860000,32.600000,0.000000
max,82.000000,1.000000,1.000000,271.740000,48.900000,1.000000

In [89]:
med = df["age"].median()
mean = df["age"].sum() / len(df["age"])
maks = df["age"].max()

In [90]:
#median
med

45.0

In [91]:
#mean
mean

43.41985946597069

In [92]:
#maksimum
maks

82.0

# Nilai Korelasi

In [93]:
df.corr()

,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
age,1.000000,0.278120,0.264852,0.236763,0.373703,0.246478
hypertension,0.278120,1.000000,0.111974,0.170028,0.158762,0.131965
heart_disease,0.264852,0.111974,1.000000,0.166847,0.060926,0.134610
avg_glucose_level,0.236763,0.170028,0.166847,1.000000,0.186348,0.133227
bmi,0.373703,0.158762,0.060926,0.186348,1.000000,0.056926
stroke,0.246478,0.131965,0.134610,0.133227,0.056926,1.000000

# Tipe Data Atribut

In [94]:
df.dtypes

gender                object
age                  float64
hypertension           int64
heart_disease          int64
ever_married          object
work_type             object
Residence_type        object
avg_glucose_level    float64
bmi                  float64
smoking_status        object
stroke                 int64
dtype: object

# Merubah Tipe data hypertension

In [95]:
des = df["hypertension"].astype("float64")*0.001

In [96]:
des

0       0.000
1       0.000
2       0.000
3       0.001
4       0.000
        ...
4976    0.000
4977    0.000
4978    0.001
4979    0.000
4980    0.001
Name: hypertension, Length: 4981, dtype: float64

# Dictionary

In [97]:
gender = ["Male","Male", "Female", "Female"]
age = ["67","80","49","79"]
df1 = pd.DataFrame({"gender":gender,"age":age})

In [98]:
df1

   gender age
0    Male  67
1    Male  80
2  Female  49
3  Female  79

# Jumlah Atribut dengan Nilai Null

In [99]:
df.isna().any().sum()

0

# 10 Record Pertama atribut Tipe data Int

In [107]:
df2 = df.select_dtypes(include="int64")
df2.head(10)

   hypertension  heart_disease  stroke
0             0              1       1
1             0              1       1
2             0              0       1
3             1              0       1
4             0              0       1
5             1              1       1
6             0              0       1
7             0              0       1
8             1              0       1
9             0              1       1

# Menyimpan Atribut Tipe int ke File CSV

In [108]:
df2.to_csv("Posttest2.csv", index=False)